import tushare as ts

# 沪深300成份及权重
# 获取沪深300当前成份股及所占权重
#
# 返回值说明：
#
# code :股票代码
# name :股票名称
# date :日期
# weight:权重

df = ts.get_hs300s()
print(df)


#           date    code  name  weight
# 0   2019-09-30  600000  浦发银行    1.12
# 1   2019-09-30  600004  白云机场    0.19
# 2   2019-09-30  600009  上海机场    0.62
# 3   2019-09-30  600010  包钢股份    0.22
# 4   2019-09-30  600011  华能国际    0.21
# ..         ...     ...   ...     ...
# 295 2019-09-30  300296   利亚德    0.10
# 296 2019-09-30  300408  三环集团    0.17
# 297 2019-09-30  300413  芒果超媒    0.08
# 298 2019-09-30  300433  蓝思科技    0.07
# 299 2019-09-30  300498  温氏股份    1.12
#
# [300 rows x 4 columns]